---
kind: property
id: P:Autodesk.Revit.DB.Sketch.SketchPlane
source: html/d463203b-c692-7217-09fc-eb4110509145.htm
---
# Autodesk.Revit.DB.Sketch.SketchPlane Property

Returns the Sketch Plane of the Sketch.

## Syntax (C#)
```csharp
public SketchPlane SketchPlane { get; }
```

## Remarks
This property is used to retrieve the Sketch Plane of Sketch.